Revit 2027 API
MultistoryStairs.ActualTreadDepth Property
 The actual depth of the stairs treads in the stairs, actual tread depth is equal to minimum tread depth by default.
Namespace: Autodesk.Revit.DB.Architecture
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public double ActualTreadDepth { get; set; }
Public Property ActualTreadDepth As Double
	Get
	Set
public:
property double ActualTreadDepth {
	double get ();
	void set (double value);
}
member ActualTreadDepth : float with get, set
Property Value
Double
Exceptions
Exception | Condition
ArgumentOutOfRangeException |  When setting this property: The given value for actualTreadDepth must be greater than 0 and no more than 30000 feet.
Remarks
 In a multistory stairs, all the stairs elements keep the same tread depth parameter value.
See Also
Reference
MultistoryStairs Class
Autodesk.Revit.DB.Architecture Namespace